In [168]:
import pandas as pd
print("‚úÖ Pandas instalado!")
print("Versi√≥n:", pd.__version__)

# Creating a DataFrame from a dictionary
# Empresa de sofware
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Hannah', 'Ian', 'Jack', 'Kathy', 'Liam', 'Mona', 'Nate', 'Olivia', 'Paul', 'Quinn', 'Rachel', 'Sam', 'Tina','Sonia'],
        'Age': [25, 30, 35, 28, 22, 40, 29, 31, 27, 33, 26, 24, 32, 42, 30, 28, 27, 31, 25, 26, 39],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Miami', 'Seattle', 'Boston', 'Denver', 'Austin', 'Houston', 'Philadelphia', 'Phoenix', 'San Diego', 'Dallas', 'Chicago', 'Detroit', 'Columbus', 'Chicago', 'Indianapolis', 'Miami', 'Miami'],
        'Occupation': ['Frontend', 'Designer', 'owner', 'Developer-back', 'Intern', 'Frontend', 'Developer-back', 'Designer', 'Intern', 'Developer-movil', 'Developer-movil', 'sales', 'Developer-lead', 'Intern', 'Manager', 'fullstack', 'sales', 'Intern', 'marketing', 'Manager', 'Developer-back'],
        'Salary': [70000, 80000, 120000, 95000, 40000, 72000, 88000, 60000, 45000, 98000, 91000, 65000, 115000, 42000, 130000, 105000, 68000, 43000, 75000, 125000, 90000]
        }
df = pd.DataFrame(data)
print(df)
print(f"Type::: {type(df)}")

‚úÖ Pandas instalado!
Versi√≥n: 2.3.3
       Name  Age           City       Occupation  Salary
0     Alice   25       New York         Frontend   70000
1       Bob   30  San Francisco         Designer   80000
2   Charlie   35    Los Angeles            owner  120000
3     David   28        Chicago   Developer-back   95000
4       Eve   22          Miami           Intern   40000
5     Frank   40        Seattle         Frontend   72000
6     Grace   29         Boston   Developer-back   88000
7    Hannah   31         Denver         Designer   60000
8       Ian   27         Austin           Intern   45000
9      Jack   33        Houston  Developer-movil   98000
10    Kathy   26   Philadelphia  Developer-movil   91000
11     Liam   24        Phoenix            sales   65000
12     Mona   32      San Diego   Developer-lead  115000
13     Nate   42         Dallas           Intern   42000
14   Olivia   30        Chicago          Manager  130000
15     Paul   28        Detroit        fullstack  105000
16    Quinn   27       Columbus            sales   68000
17   Rachel   31        Chicago           Intern   43000
18      Sam   25   Indianapolis        marketing   75000
19     Tina   26          Miami          Manager  125000
20    Sonia   39          Miami   Developer-back   90000
Type::: <class 'pandas.core.frame.DataFrame'>

### SELECCI√ìN DE DATOS EN PANDAS MEDIANTE `loc`, `iloc` Y NOMBRE DIRECTO ####

In [135]:
## 1. Selecci√≥n por POSICI√ìN ‚Üí `iloc`
# Se usa cuando quieres acceder por _√≠ndices num√©ricos_ (0, 1, 2‚Ä¶).
print("---- Fila 0, Columna 2")
print(df.iloc[0, 2])        # Fila 0, Columna 2 #‚Üí 'New York'
print("---- Fila 3 completa")
# Fila 3 completa, presentada de forma tubular
F3= df.iloc[3] # df.iloc[3, :] 
# type(F3)  #‚Üí pandas.core.series.Series
print(F3)
print("---- Columna 'Occupation'")
print(df.iloc[:, 3])    # Toda la columna 3 (Occupation)
print("---- Primeras 5 filas, primeras 3 columnas")
print(df.iloc[0:5, 0:3])  # Primeras 5 filas, primeras 3 columnas
print("---- Primeras 5 filas, columnas 0 y 3")
print(df.iloc[0:5, [0, 3]])
print("---- Filas 0, 5 y 15; Columnas 0, 2 y 3")
print(df.iloc[[0, 5, 15], [0, 2, 3]])  # Filas 0, 2 y 4; Columnas 1 y 3

---- Fila 0, Columna 2
New York
---- Fila 3 completa
Name                   David
Age                       28
City                 Chicago
Occupation    Developer-back
Salary                 95000
Name: 3, dtype: object
---- Columna 'Occupation'
0            Frontend
1            Designer
2               owner
3      Developer-back
4              Intern
5            Frontend
6      Developer-back
7            Designer
8              Intern
9     Developer-movil
10    Developer-movil
11              sales
12     Developer-lead
13             Intern
14            Manager
15          fullstack
16              sales
17             Intern
18          marketing
19            Manager
20     Developer-back
Name: Occupation, dtype: object
---- Primeras 5 filas, primeras 3 columnas
      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago
4      Eve   22          Miami
---- Primeras 5 filas, columnas 0 y 3
      Name      Occupation
0    Alice        Frontend
1      Bob        Designer
2  Charlie           owner
3    David  Developer-back
4      Eve          Intern
---- Filas 0, 5 y 15; Columnas 0, 2 y 3
     Name      City Occupation
0   Alice  New York   Frontend
5   Frank   Seattle   Frontend
15   Paul   Detroit  fullstack

In [136]:
## 2. Selecci√≥n por POSICI√ìN ‚Üí `loc`
# Se usa cuando quieres acceder por _etiquetas de fila y/o columna.
print("---- Fila 0, Columna 'City'")
print(df.loc[0, "City"])        # Fila 0, Columna 'City' #‚Üí 'New York'
print("---- Fila 3 completa")
# Fila 3 completa, presentada de forma tubular?
print("---- Fila 3 completa")
F3 = df.loc[3]  # df.loc[3, :]
# Nota en algunos diccionarios los indices pueden ser cadenas de texto
# type(F3)  #‚Üí pandas.core.series.Series
print(F3)
print("---- Columna 'Occupation'")
print(df.loc[:, "Occupation"])    # Toda la columna 3 (Occupation)
print("---- Primeras 5 filas, primeras 3 columnas")
print(df.loc[0:4, ["Name", "Age", "City"]])
print("---- Primeras 5 filas, columnas 0 y 3")
print(df.loc[0:4, ["Name", "Occupation"]])
print("---- Filas 0, 5 y 15; Columnas 0, 2 y 3")
print(df.loc[[0, 5, 15], ["Name", "City", "Occupation"]])  # Filas 0, 2 y 4; Columnas 1 y 3

---- Fila 0, Columna 'City'
New York
---- Fila 3 completa
---- Fila 3 completa
Name                   David
Age                       28
City                 Chicago
Occupation    Developer-back
Salary                 95000
Name: 3, dtype: object
---- Columna 'Occupation'
0            Frontend
1            Designer
2               owner
3      Developer-back
4              Intern
5            Frontend
6      Developer-back
7            Designer
8              Intern
9     Developer-movil
10    Developer-movil
11              sales
12     Developer-lead
13             Intern
14            Manager
15          fullstack
16              sales
17             Intern
18          marketing
19            Manager
20     Developer-back
Name: Occupation, dtype: object
---- Primeras 5 filas, primeras 3 columnas
      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago
4      Eve   22          Miami
---- Primeras 5 filas, columnas 0 y 3
      Name      Occupation
0    Alice        Frontend
1      Bob        Designer
2  Charlie           owner
3    David  Developer-back
4      Eve          Intern
---- Filas 0, 5 y 15; Columnas 0, 2 y 3
     Name      City Occupation
0   Alice  New York   Frontend
5   Frank   Seattle   Frontend
15   Paul   Detroit  fullstack

In [137]:
# df[...] est√° dise√±ado para aceptar distintos tipos de argumentos, y pandas decide qu√© hacer seg√∫n el tipo de ese argumento.
# df["Name"] ‚Üí una sola etiqueta de columna ‚Üí devuelve una Series con esa columna. (selecci√≥n simple)
# df[["Name", "Occupation"]] ‚Üí lista de etiquetas de columna ‚Üí devuelve un DataFrame con esas columnas.
# df[mask_booleana] ‚Üí una m√°scara booleana ‚Üí devuelve un DataFrame filtrado seg√∫n la m√°scara.
### df[mask][['col1', 'col2']] // Indexaci√≥n directa

In [138]:
# 3. Selecci√≥n simple por NOMBRE DIRECTO (solo columna) parte1
# Se usa cuando quieres acceder por _nombres de columna_ directamente.
### Para obtener **Series** (una sola columna) uso de corchetes simples `[]`
### NOTA: Para obtener **DataFrame** (varias columnas) uso de corchetes dobles

##### output: SERIES
print("---- Columna 'City' directamente")
print(df["City"])    # Toda la columna 'City'
print(type(df["City"]))  #‚Üí pandas.core.series.Series
##### output: DATAFRAME
print("---- Columna 'City' directamente como DataFrame (con cabecera)")
print(df[["City"]])    # Toda la columna 'City'
print(type(df[["City"]]))  #‚Üí pandas.core.frame.DataFrame

---- Columna 'City' directamente
0          New York
1     San Francisco
2       Los Angeles
3           Chicago
4             Miami
5           Seattle
6            Boston
7            Denver
8            Austin
9           Houston
10     Philadelphia
11          Phoenix
12        San Diego
13           Dallas
14          Chicago
15          Detroit
16         Columbus
17          Chicago
18     Indianapolis
19            Miami
20            Miami
Name: City, dtype: object
<class 'pandas.core.series.Series'>
---- Columna 'City' directamente como DataFrame (con cabecera)
             City
0        New York
1   San Francisco
2     Los Angeles
3         Chicago
4           Miami
5         Seattle
6          Boston
7          Denver
8          Austin
9         Houston
10   Philadelphia
11        Phoenix
12      San Diego
13         Dallas
14        Chicago
15        Detroit
16       Columbus
17        Chicago
18   Indianapolis
19          Miami
20          Miami
<class 'pandas.core.frame.DataFrame'>

In [139]:
# La selecci√≥n simple por NOMBRE DIRECTO permite filtrar filas basadas en condiciones espec√≠ficas aplicadas a las columnas del DataFrame.
# Esto se logra creando m√°scaras booleanas que representan las condiciones deseadas y luego aplic√°ndolas al DataFrame para obtener un subconjunto filtrado.
### Ejemplo 1
print(df[df['Age'] >= 39])  # Rows where Age >= 39
print("-----------------------------------------")

### Ejemplo 2 - M√∫ltiples condiciones:
# 1. condici√≥n 2: Filtrar por edad mayor a 28
condicion_edad = df['Age'] >= 28
# 2. condici√≥n 1: Filtrar por ciudades 'Chicago' o 'Miami'
condicion_ciudades = (df['City'] == 'Chicago') | (df['City'] == 'Miami')
# 3. condici√≥n 3: Filtrar por ocupaci√≥n 'Intern' o 'Developer 
condicion_ocupacion = (df['Occupation'] == 'Intern') | (df['Occupation'] == 'Developer')
# 4. Combina las tres condiciones con AND (&)
# (Ciudades Y Edad Y Ocupaci√≥n)
resultado = df[condicion_ciudades & condicion_edad & condicion_ocupacion][['Name', 'City', 'Occupation']]
print(resultado)
type(resultado)  #‚Üí pandas.core.frame.DataFrame

     Name  Age     City      Occupation  Salary
5   Frank   40  Seattle        Frontend   72000
13   Nate   42   Dallas          Intern   42000
20  Sonia   39    Miami  Developer-back   90000
-----------------------------------------

      Name     City Occupation
17  Rachel  Chicago     Intern

pandas.core.frame.DataFrame

In [140]:
# 3. Selecci√≥n por lista de NOMBRES DIRECTOS (solo columnas) parte2
# Se usa cuando quieres acceder por _nombres de columna_ directamente.
### Para obtener **DataFrame** (varias columnas) uso de corchetes dobles
### NOTA: Para obtener **Series** (una sola columna) uso de corchetes simples `[]`
##### output: DataFrame
#print(df[['Name']])  # Select specific columns (retorna un DataFrame y no una Serie)
print("----DataFrame de 2 columnas----")
print(df[["Name", "Occupation"]])  # Columnas 'Name' y 'Occupation'
# equivalente a: df.loc[:, ["Name", "Occupation"]]
# usa el operador de indexaci√≥n del DataFrame y solo permite seleccionar columnas por nombre cuando se pasa una lista.
#////
# NOTA: para seleccionar a la vez filas y columnas por sus ‚Äúdos ejes‚Äù en la forma df[filas, columnas] se requiere usar uno de los indexadores, iloc o loc, o bien una variante equivalente como df.where o boolean indexing, pero ya no sirve la sintaxis simple df[...] de una sola dimensi√≥n.

----DataFrame de 2 columnas----
       Name       Occupation
0     Alice         Frontend
1       Bob         Designer
2   Charlie            owner
3     David   Developer-back
4       Eve           Intern
5     Frank         Frontend
6     Grace   Developer-back
7    Hannah         Designer
8       Ian           Intern
9      Jack  Developer-movil
10    Kathy  Developer-movil
11     Liam            sales
12     Mona   Developer-lead
13     Nate           Intern
14   Olivia          Manager
15     Paul        fullstack
16    Quinn            sales
17   Rachel           Intern
18      Sam        marketing
19     Tina          Manager
20    Sonia   Developer-back

### Selecci√≥n avanzada ####

In [141]:
# üü£ 4. Selecci√≥n avanzada
### ‚úî Indexaci√≥n directa - df[mask][['col1', 'col2']]
### De la forma:
# mascara_booleana = (condicion1) & (condicion2)
# df_filtrado = df[mascara_booleana][["columna"]]
# ----
# print(df[df['Age'] > 28])  # Rows where Age > 28
# print(df[(df['Age'] > 28) & (df['City'] == 'Chicago')])  # Multiple conditions
df[(df['Age'] > 28) & ((df['City'] == 'Chicago') | (df['City'] == 'Miami'))][['Name', 'City', 'Occupation']]
# nota: el operador & representa "AND" y el operador | representa "OR" en pandas.
# nota: la expresion [['Name', 'City', 'Occupation']] se utiliza para seleccionar m√∫ltiples columnas espec√≠ficas del DataFrame resultante despu√©s de aplicar las condiciones de filtrado.
# nota: si no se incluye esta parte, el resultado incluir√° todos lo campos(columnas) del DataFrame original para las filas que cumplen las condiciones de filtrado.

      Name     City      Occupation
14  Olivia  Chicago         Manager
17  Rachel  Chicago          Intern
20   Sonia    Miami  Developer-back

In [142]:

##### CON 3 CONDICIONES #####
condicion_edad = df['Age'] > 28
condicion_ciudades = (df['City'] == 'Chicago') | (df['City'] == 'Miami')
condicion_ocupation = df['Occupation'] == 'Developer-back'
df[condicion_edad & condicion_ciudades & condicion_ocupation][['Name', 'City', 'Occupation']]

     Name   City      Occupation
20  Sonia  Miami  Developer-back

In [143]:
# üü£ 4. Selecci√≥n avanzada
### ‚úî Usar `isin`
# 'isin' permite filtrar filas seg√∫n si una columna tiene valores dentro de una lista dada.
# En Excel es similar a: aplicar Filtro a la tabla por varios valores,
# o usar funciones como OR() y COUNTIF() para comprobar si un valor est√° en una lista.
#### CON 1 CONDICI√ìN #####
print(df[df['City'].isin(['Chicago', 'Miami'])]) 
# Dataframe, con las filas que tengas comoCities Chicago or Miami

      Name  Age     City      Occupation  Salary
3    David   28  Chicago  Developer-back   95000
4      Eve   22    Miami          Intern   40000
14  Olivia   30  Chicago         Manager  130000
17  Rachel   31  Chicago          Intern   43000
19    Tina   26    Miami         Manager  125000
20   Sonia   39    Miami  Developer-back   90000

In [144]:
##### CON 2 CONDICIONES ##### (Es posible indicar que columnas incluir en el resultado)
# 1. Crea la condici√≥n de Ciudades usando .isin()
condicion_ciudades = df['City'].isin(['Chicago', 'Miami'])
# 2. Crea la condici√≥n de Edad
condicion_edad = df['Age'] > 28
# 3. Combina y aplica las condiciones
df[condicion_ciudades & condicion_edad][['Name', 'City', 'Occupation']]

      Name     City      Occupation
14  Olivia  Chicago         Manager
17  Rachel  Chicago          Intern
20   Sonia    Miami  Developer-back

In [145]:
##### CON 3 CONDICIONES #####
# 1. Condici√≥n de Ciudades (OR)
condicion_ciudades = df['City'].isin(['Chicago', 'Miami'])
# 2. Condici√≥n de Edad (AND)
condicion_edad = df['Age'] > 28
# 3. Condici√≥n de Ocupaci√≥n (AND)
condicion_ocupacion = df['Occupation'] == 'Developer-back' # Nueva condici√≥n
# 4. Combina las tres condiciones con AND (&)
# (Ciudades Y Edad Y Ocupaci√≥n)
resultado = df[condicion_ciudades & condicion_edad & condicion_ocupacion][['Name', 'City', 'Occupation']]
print(resultado)
type(resultado)  #‚Üí pandas.core.frame.DataFrame

     Name   City      Occupation
20  Sonia  Miami  Developer-back

pandas.core.frame.DataFrame

In [146]:
# üü£ 4. Selecci√≥n avanzada
### ‚úî Selecci√≥n por query
### (filtrado con query o filtrado con expresi√≥n tipo SQL.)
# todas las columnas de los registros filtrados
# print(df.query("Age > 28 and City == 'Chicago'"))
# solo la columna name y city de los registros filtrados
# df.query("Age > 28 and City == 'Chicago'")[['Name', 'City', 'Occupation']]
df.query("Age > 28 and (City == 'Chicago' or City == 'Miami')")[['Name', 'City', 'Occupation']]

      Name     City      Occupation
14  Olivia  Chicago         Manager
17  Rachel  Chicago          Intern
20   Sonia    Miami  Developer-back

In [147]:
resultado = df.query(
    "(City == 'Chicago' or City == 'Miami')"
    " and Age > 28"
    " and Occupation == 'Developer-back'"
)[['Name', 'City', 'Occupation']]
print(resultado)

     Name   City      Occupation
20  Sonia  Miami  Developer-back

In [148]:
# üü£ 4. Selecci√≥n avanzada
### ‚úî loc con m√°scara booleana
##### CON 2 CONDICIONES #####
# Using .loc for label-based indexing with multiple conditions (forma Logica)
df.loc[(df['Age'] > 28) & (df['City'].isin(['Chicago', 'Miami'])), ['Name', 'City', 'Occupation']]
# nota: el operador & se usa para AND, y el operador | se usa para OR

      Name     City      Occupation
14  Olivia  Chicago         Manager
17  Rachel  Chicago          Intern
20   Sonia    Miami  Developer-back

In [149]:
#-----------------------------------------

In [150]:
print(df[1:3]) # Select specific rows
# df[1:3] es equivalente a df.iloc[1:3, :]
# Es posible indicar que columnas incluir en el resultado:
# print(df[1:3][['Name', 'City']])

      Name  Age           City Occupation  Salary
1      Bob   30  San Francisco   Designer   80000
2  Charlie   35    Los Angeles      owner  120000

In [151]:
#Use the unique method to determine the unique elements in a column of a DataFrame.
unique_dates = df['Age'].unique()
print(unique_dates)
print("-----"*7)
unique_occupations = df['Occupation'].unique()
print(unique_occupations)
print("-----"*7)
unique_cities = df['City'].unique()
print(unique_cities)
print("-----"*7)
#Cuantas ciudades √∫nicas hay?
# Devuelve el n√∫mero de valores distintos, excluyendo NaN por defecto.
num_unique_cities = df['City'].nunique()
print(f"N√∫mero de ciudades √∫nicas: {num_unique_cities}") # N√∫mero de ciudades √∫nicas: 17
#Cuantas filas hay en la columna City?
num_total_cities = len(df['City'])
print(f"N√∫mero total de filas en la columna 'City': {num_total_cities}")
# Devuelve el n√∫mero total de filas en esa columna, incluidas las que tienen NaN. No sirve para contar valores distintos, solo cuenta cu√°ntos registros hay.
# Cuantas ciudades √∫nicas hay? otra forma (puede incluir el valor NaN si existe):
num_unique_cities_with_nan = len(df['City'].unique())
print(f"N√∫mero de ciudades √∫nicas (incluyendo NaN si existe): {num_unique_cities_with_nan}")

[25 30 35 28 22 40 29 31 27 33 26 24 32 42 39]
-----------------------------------
['Frontend' 'Designer' 'owner' 'Developer-back' 'Intern' 'Developer-movil'
 'sales' 'Developer-lead' 'Manager' 'fullstack' 'marketing']
-----------------------------------
['New York' 'San Francisco' 'Los Angeles' 'Chicago' 'Miami' 'Seattle'
 'Boston' 'Denver' 'Austin' 'Houston' 'Philadelphia' 'Phoenix' 'San Diego'
 'Dallas' 'Detroit' 'Columbus' 'Indianapolis']
-----------------------------------
N√∫mero de ciudades √∫nicas: 17
N√∫mero total de filas en la columna 'City': 21
N√∫mero de ciudades √∫nicas (incluyendo NaN si existe): 17

In [152]:
# 'Conteo de ocurrencias' de cada ciudad
city_counts = df['City'].value_counts()
print("Conteo de ocurrencias de cada ciudad:")
print(city_counts)

Conteo de ocurrencias de cada ciudad:
City
Miami            3
Chicago          3
New York         1
Los Angeles      1
San Francisco    1
Seattle          1
Boston           1
Denver           1
Austin           1
Houston          1
Philadelphia     1
Phoenix          1
San Diego        1
Dallas           1
Detroit          1
Columbus         1
Indianapolis     1
Name: count, dtype: int64

In [153]:
# 'Conteo de ocurrencias' de cada ocupaci√≥n
occupation_counts = df['Occupation'].value_counts()
print("Conteo de ocurrencias de cada ocupaci√≥n:")
print(occupation_counts)

Conteo de ocurrencias de cada ocupaci√≥n:
Occupation
Intern             4
Developer-back     3
Frontend           2
Manager            2
Designer           2
Developer-movil    2
sales              2
owner              1
Developer-lead     1
fullstack          1
marketing          1
Name: count, dtype: int64

In [154]:
# Ordenar (devuelve DataFrame)
df.sort_values(by='Age', ascending=False)[['Name', 'Age']]

       Name  Age
13     Nate   42
5     Frank   40
20    Sonia   39
2   Charlie   35
9      Jack   33
12     Mona   32
17   Rachel   31
7    Hannah   31
1       Bob   30
14   Olivia   30
6     Grace   29
3     David   28
15     Paul   28
8       Ian   27
16    Quinn   27
19     Tina   26
10    Kathy   26
18      Sam   25
0     Alice   25
11     Liam   24
4       Eve   22

In [155]:
# df.shape devuelve las dimensiones del DataFrame como una tupla (n_filas, n_columnas)
# df.shape ‚Üí devuelve algo como (n_filas, n_columnas).
# df.shape[0] ‚Üí toma el primer elemento de la tupla, es decir, el n√∫mero de filas.
# df.shape[1] ‚Üí toma el segundo elemento, el n√∫mero de columnas.
print(df.shape)  #‚Üí (21, 5)
print(df.shape[0])  #‚Üí 21 (Hay 21 registros/filas)
print(df.shape[1])  #‚Üí 5 (Hay 5 columnas)

(21, 5)
21
5

In [156]:
# Suma de salarios totales, con formato de decimales y separadores de miles
total_salary = df['Salary'].sum()
print(f"Suma total de salarios: {total_salary:,.2f}")
# (usa la coma para miles y el punto para decimales)

# promedio entre todos los empleados
average_salary = df['Salary'].mean()
# .mean() calcula el promedio aritm√©tico de los valores en la columna 'Salary'.
# los valores NaN se ignoran autom√°ticamente en el c√°lculo del promedio.
print(f"Salario promedio: {average_salary:,.2f} (21 empleados)")

Suma total de salarios: 1,717,000.00
Salario promedio: 81,761.90 (21 empleados)

In [169]:
# Resetear el √≠ndice del DataFrame despu√©s de filtrar filas
# Ese c√≥digo se usa para ‚Äúlimpiar‚Äù el √≠ndice despu√©s de filtrar, para que el nuevo DataFrame tenga un √≠ndice consecutivo empezando en 0, sin huecos.
filtered_df = df[df['Age'] >= 39].reset_index(drop=True)
print("DataFrame filtrado (con √≠ndice reseteado):")
print(filtered_df)
# No toma los √≠ndices antiguos del DataFrame original (que era 5 Frank, 13 Nate, 20 Sonia)
# -------------
print("-------------------------------------------")
print("Pero NO se ha modificado el DataFrame original:")
print(df.head(6))

DataFrame filtrado (con √≠ndice reseteado):
    Name  Age     City      Occupation  Salary
0  Frank   40  Seattle        Frontend   72000
1   Nate   42   Dallas          Intern   42000
2  Sonia   39    Miami  Developer-back   90000
-------------------------------------------
Pero NO se ha modificado el DataFrame original:
      Name  Age           City      Occupation  Salary
0    Alice   25       New York        Frontend   70000
1      Bob   30  San Francisco        Designer   80000
2  Charlie   35    Los Angeles           owner  120000
3    David   28        Chicago  Developer-back   95000
4      Eve   22          Miami          Intern   40000
5    Frank   40        Seattle        Frontend   72000

In [170]:
# Renombrar columnas # SE APLICA AL DATAFRAME ORIGINAL
df.rename(columns={'Name': 'Employee', 'Age': 'Employee_Age', 'Salary': 'Annual_Salary'}, inplace=True)
# Mostrar los 6 primeros registros con las nuevas columnas
print(df.head(6))

  Employee  Employee_Age           City      Occupation  Annual_Salary
0    Alice            25       New York        Frontend          70000
1      Bob            30  San Francisco        Designer          80000
2  Charlie            35    Los Angeles           owner         120000
3    David            28        Chicago  Developer-back          95000
4      Eve            22          Miami          Intern          40000
5    Frank            40        Seattle        Frontend          72000

In [171]:
# Eliminar columnas
# ERROR # df_new = df.drop(columns=['City', 'Job Title'], inplace=True).reset_index(drop=True) # ERROR
df_new = df.drop(columns=['City', 'Occupation']).reset_index(drop=True)
print("DataFrame despu√©s de eliminar columnas 'City' y 'Occupation':")
print(df_new)

DataFrame despu√©s de eliminar columnas 'City' y 'Occupation':
   Employee  Employee_Age  Annual_Salary
0     Alice            25          70000
1       Bob            30          80000
2   Charlie            35         120000
3     David            28          95000
4       Eve            22          40000
5     Frank            40          72000
6     Grace            29          88000
7    Hannah            31          60000
8       Ian            27          45000
9      Jack            33          98000
10    Kathy            26          91000
11     Liam            24          65000
12     Mona            32         115000
13     Nate            42          42000
14   Olivia            30         130000
15     Paul            28         105000
16    Quinn            27          68000
17   Rachel            31          43000
18      Sam            25          75000
19     Tina            26         125000
20    Sonia            39          90000